//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьФича_файл()","УМеняЕстьФича_файл","Допустим у меня есть фича-файл");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ИнструментVanessa_Behavior()","ИнструментVanessa_Behavior","и инструмент Vanessa-Behavior");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯВVanessa_BehaviorЗапускаюГенерациюEpf()","ЯВVanessa_BehaviorЗапускаюГенерациюEpf","Когда я в Vanessa-Behavior запускаю генерацию epf");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"РядомСФича_файломДолженПоявитьсяФайлEpf()","РядомСФича_файломДолженПоявитьсяФайлEpf","Тогда рядом с фича-файлом должен появиться файл epf");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим у меня есть фича-файл
//@УМеняЕстьФича_файл()
Процедура УМеняЕстьФича_файл() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//и инструмент Vanessa-Behavior
//@ИнструментVanessa_Behavior()
Процедура ИнструментVanessa_Behavior() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда я в Vanessa-Behavior запускаю генерацию epf
//@ЯВVanessa_BehaviorЗапускаюГенерациюEpf()
Процедура ЯВVanessa_BehaviorЗапускаюГенерациюEpf() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда рядом с фича-файлом должен появиться файл epf
//@РядомСФича_файломДолженПоявитьсяФайлEpf()
Процедура РядомСФича_файломДолженПоявитьсяФайлEpf() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля
